Revit 2024 API
StructuralSectionZProfile Class
 Defines parameters for Z Profile structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionZProfile : StructuralSectionGeneralLZ
Visual Basic
Public Class StructuralSectionZProfile _
	Inherits StructuralSectionGeneralLZ
Visual C++
public ref class StructuralSectionZProfile : public StructuralSectionGeneralLZ
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
See Also
StructuralSectionZProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace